benchmark/old_outputs/thread_equals_client/clock/uni_8/2026-04-19T21:13:42-04:00_9_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 8
number of threads: 8
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 4004805
number of failed transactions: 0 (0.000%)
latency average = 0.360 ms
initial connection time = 3.072 ms
tps = 22248.950411 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 9 (targets 90.0% of total)
 - 3594148 transactions (89.7% of total)
 - number of transactions actually processed: 3594148 (tps = 19967.519173)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.177 ms
 - latency stddev = 0.321 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 10.0% of total)
 - 398300 transactions (9.9% of total)
 - number of transactions actually processed: 398300 (tps = 2212.781134)
 - number of failed transactions: 0 (0.000%)
 - latency average = 1.986 ms
 - latency stddev = 4.039 ms
ratio: .28874379256191174